chauphuocvu/LCD-water-control-28-11/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/GUIlib/src/uiappuser.c
}
//////////////////////////////////////////////////////////////
void ParametersPoolVolumeScreen_OK(void)
{
	PoolVolume = PoolVolume_Display;
}
//////////////////////////////////////////////////////////////
void ParametersPoolVolumeScreen_FiltrationPeriod(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersFitrationPeriodScreen();
}



/*ParametersFitrationPeriod Screen */
void ParametersFitrationPeriodScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
///////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_inc(void)
{
		FiltrationPeriod_Display +=1;
	if (FiltrationPeriod_Display > 24)
		FiltrationPeriod_Display = 24;
}
	///////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_dec(void)
{	
	if (FiltrationPeriod_Display == 6)
		FiltrationPeriod_Display = 6;
	else
		FiltrationPeriod_Display -=1;
}
	//////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_OK(void)
{
	FiltrationPeriod = FiltrationPeriod_Display;
}
	//////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_PoolVolume(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersPoolVolumeScreen();
}




/*ParametersWaterScreen */
void ParametersWaterScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
///////////////////////////////////////////////////////////////
void ParametersWaterScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Indoor(void)
{
	PoolSelect = INDOOR;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Outdoor(void)
{
	PoolSelect = OUTDOOR;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_ExtremeCondition(void)
{
	PoolSelect = EXTREME_CONDITION;
	DestroyPage(CurrentScreen);
	Show_WarningExtremeConditionScreen();
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Less20oC(void)
{
	Temperature = LESS20oC;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_20oC_30oC(void)
{
	Temperature = MIDDLE_20oC_30oC;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_More30oC(void)
{
	Temperature = MORE30oC;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Soft(void)
{
	WaterHardnessSelect = SOFT;
	DestroyPage(CurrentScreen);
	Show_WarningWaterHardnessScreen();
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Hard(void)
{
	WaterHardnessSelect = HARD;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_VeryHard(void)
{
	WaterHardnessSelect = VERY_HARD;
}



/* WarningMaximalSafetyScreen */
void WarningMaximalSafetyScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}


void WarningExtremeConditionScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}


void WarningWaterHardnessScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}


void WarningProbeCalibration62_78Screen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationpHProbeScreen();
}


void WarningProbeCalibrationScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationpHProbeScreen();
}

void WarningProbeCalibration70Screen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationpHProbeScreen();
}

void WarningProbeCalibrationRequiredValueScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationCLFProbeScreen();
}

void WarningProbeCalibrationRequiredValueRedScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationCLFProbeScreen();
}


void WarningProbeCalibrationRequiredValueImpossibleScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}

void WarningTooRapidChangeScreen_CancelRestictions(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}




/*ParametersRequireValuepH Screen */
void ParametersRequireValuepHScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_inc(void)
{
		RequireValuepH_Display +=(float)0.1;
	if(RequireValuepH_Display > 7.8)
		RequireValuepH_Display = 7.8;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_dec(void)
{
	if(RequireValuepH_Display < 6.2)
		RequireValuepH_Display = 6.2;
	else
		RequireValuepH_Display -=(float)0.1;
	
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_OK(void)
{
	RequireValuepH = RequireValuepH_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_CLF(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueCLFScreen();
}




/*ParametersRequireValueCLF Screen */
void ParametersRequireValueCLFScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_inc(void)
{
		RequireValueCLF_Display +=(float)0.1;
	if(RequireValueCLF_Display > 1.2)
		RequireValueCLF_Display = 1.2;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_dec(void)
{	
	if(RequireValueCLF_Display < 0.5)
		RequireValueCLF_Display = 0.5;
	else
		RequireValueCLF_Display -=(float)0.1;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_OK(void)
{
	RequireValueCLF = RequireValueCLF_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_pH(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValuepHScreen();
}

/*Calibration Screen */
void CalibrationScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_SettingsScreen();
}
void CalibrationScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
void CalibrationScreen_CLFProbe(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationCLFProbeScreen();
	DestroyPage(CurrentScreen);
	Show_WarningProbeCalibrationRequiredValueScreen();
}
void CalibrationScreen_pHProbe(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationpHProbeScreen();
	DestroyPage(CurrentScreen);
	Show_WarningProbeCalibration70Screen();	
}
void CalibrationScreen_WaterThermometer(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationWaterScreen();
}
void CalibrationScreen_AirThermometer(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationAirScreen();
}


/*CalibrationpHProbe Screen */
void CalibrationpHProbeScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationScreen();
}
void CalibrationpHProbeScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
void CalibrationpHProbeScreen_inc(void)
{
		Probe_pH_Display +=0.1;
	if(Probe_pH_Display > 7.8)
	{
		DestroyPage(CurrentScreen);
		Show_WarningProbeCalibration62_78Screen();
		Probe_pH_Display = 7.8;
	}
}
void CalibrationpHProbeScreen_dec(void)
{
		Probe_pH_Display -=(float)0.1;
	if(Probe_pH_Display < 6.2)
	{
		DestroyPage(CurrentScreen);
		Show_WarningProbeCalibration62_78Screen();
		Probe_pH_Display = 6.2;
	}
}
void CalibrationpHProbeScreen_OK(void)
{
	Probe_pH = Probe_pH_Display;
}




/*CalibrationCLFProbe Screen */
void CalibrationCLFProbeScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationScreen();
}
void CalibrationCLFProbeScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
void CalibrationCLFProbeScreen_inc(void)
{
	Probe_CLF_Display +=(float)0.1;
	if (Probe_CLF_Display > 1.2)
		Probe_CLF_Display = 1.2;
}
void CalibrationCLFProbeScreen_dec(void)
{
	if(Probe_CLF_Display == RequireValueCLF)
	{
		DestroyPage(CurrentScreen);
		Show_WarningProbeCalibrationrequiredValueRedScreen();
	}
	else if (Probe_CLF_Display < 0.5)
		Probe_CLF_Display = 0.5;
	else
		Probe_CLF_Display -=(float)0.1;
}
void CalibrationCLFProbeScreen_OK(void)
{
	Probe_CLF = Probe_CLF_Display;
}


/*ParametersRequireValueRedoxpH_Redox Screen */
void ParametersRequireValueRedoxpH_RedoxScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_inc(void)
{
		RequireValueRedoxpH_Redox_Display +=10;
	if(RequireValueRedoxpH_Redox_Display > 990)
		RequireValueRedoxpH_Redox_Display = 990;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_dec(void)
{
		RequireValueRedoxpH_Redox_Display -=10;
	if(RequireValueRedoxpH_Redox_Display < 10)
		RequireValueRedoxpH_Redox_Display = 10;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_OK(void)
{
	RequireValueRedoxpH_Redox = RequireValueRedoxpH_Redox_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_pH(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueRedoxpH_pHScreen();
}



